package com.example.selectionapp;

public class ArrayString {

        public static String[] food = {"아침식사", "점심식사", "저녁식사", "간식"};

        public static String[] toilet = {
                "화장실을 사용하고 싶어요.",
                "비누를 주세요.",
                "수건을 가져다 주시겠어요?",
                "칫솔이 필요해요.",
                "치약을 주세요."
        };

        public static String[] cloth = {
                "셔츠를 입고 싶어요.",
                "바지를 주세요.",
                "드레스를 입고 싶어요.",
                "재킷이 필요해요.",
                "양말을 주세요.",
                "신발을 신고 싶어요."
        };

        public static String[] temperature = {
                "너무 더워요.",
                "너무 추워요.",
                "온도가 적당해요.",
                "조금 따뜻해요."
        };

        public static String[] headache = {
                "머리가 아파요.",
                "머리가 아파서 고생해요.",
                "두통이 있어요. 이 약 주세요.",
                "머리 아픈 거 좀 주세요.",
                "머리 아픈데 도와주세요."
        };

        public static String[] legPain = {
                "다리가 아파요.",
                "다리가 아파서 고생해요.",
                "다리 통증을 완화해 주시겠어요?",
                "다리에 뭔가 필요해요.",
                "다리 통증 완화 부탁드려요."
        };

        public static String[] throatDiscomfort = {
                "목이 아파요.",
                "목이 불편해요.",
                "목에 뭔가 주세요.",
                "목이 아프니까 완화해주세요.",
                "삼키는 게 아파요."
        };

        public static String[] heart = {
                "가슴이 아파요.",
                "심장이 아파요.",
                "가슴이 불편해요.",
                "심장 문제가 생긴 것 같아요.",
                "도와주세요, 심장 관련 증상이 있어요."
        };

        public static String[] lightContent = {
                "조명을 켜 주세요.",
                "불을 끄도록 해주세요.",
                "불의 밝기를 조절해 주세요.",
                "방 안이 더 밝아야 해요.",
                "불을 어둡게 해 주세요.",
                "불이 너무 밝아요. 낮춰 주시겠어요?",
                "나이트 라이트를 켜 주세요."
        };

        public static String[] cleanlinessContent = {
                "방 청소가 필요해요.",
                "누군가 청소를 도와줄 수 있나요?",
                "구역을 정리해 주세요.",
                "바닥을 쓸어 주세요.",
                "탁자를 청소해 주세요.",
                "청소에 도움이 필요해요."
        };

        public static String[] windowContent = {
                "창문을 열고 싶어요.",
                "창문을 닫아 주세요.",
                "창문을 열어 주시겠어요?",
                "날씨가 추워졌어요. 창문을 닫아 주세요.",
                "커튼을 열어 주세요.",
                "블라인드를 닫아 주세요."
        };

        public static String[] bugContent = {
                "방 안에 벌레가 있어요.",
                "벌레를 없애 주시겠어요?",
                "벌레 문제에 도움이 필요해요.",
                "벌레를 처리해 주세요.",
                "거기 거미가 있어요. 대처해 주세요?",
                "벌레를 제거해 주세요."
        };

        public static String[] walkContent = {
                "산책을 가요.",
                "산책을 하고 싶어요.",
                "외출해서 산책을 할래요?",
                "산책이 좋겠어요.",
                "저와 함께 산책해주세요.",
                "밖에서 공기를 마시러 가고 싶어요."
        };

        public static String[] gameContent = {
                "게임을 하고 싶어요.",
                "함께 게임하면 좋겠어요?",
                "게임으로 즐거운 시간을 가졌으면 해요.",
                "게임 어떤 걸 할까요?",
                "지금 게임하기 기분이에요.",
                "게임은 즐겁습니다. 함께 해요."
        };

        public static String[] musicContent = {
                "음악을 틀어 주세요.",
                "음악을 들려주세요?",
                "음악을 듣고 싶어요.",
                "음악을 틀어 주세요.",
                "음악은 마음을 편안하게 해요. 틀어주세요.",
                "함께 음악을 즐겨요."
        };

        public static String[] tvContent = {
                "TV를 볼까요?",
                "TV에 뭐가 나오는지 봐요.",
                "TV를 켜 주세요.",
                "채널을 바꿔 주세요.",
                "함께 TV 시청하자.",
                "TV 시청하는 게 좋겠어요."
        };
    }


